Rafa350/EOS/v2/Include/HTL/STM32/htlGPIO.h
    #ifdef GPIOA_BASE
        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin0> {
            enum class GPIOAlt {
                eth_MII_CRS = 11,
                #ifdef EOS_STM32F7
                    sai2_SD_B = 10,
                #endif
                tim2_CH1 = 1,
                tim2_ETR = 1,
                tim5_CH1 = 2,
                tim8_ETR = 3,
                usart2_CTS = 7,
                uart4_TX = 8,
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 0;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin1> {
            enum class GPIOAlt {
                eth_MII_RX_CLK = 11,
                #ifdef EOS_STM32F7
                    sai2_MCK_B = 10,
                #endif
                tim2_CH2 = 2,
                tim5_CH2 = 3,
                usart2_RTS = 7,
                uart4_RX = 8
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 1;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin3> {
            enum class GPIOAlt {
            	ltdc_B5 = 14
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 3;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin4> {
            enum class GPIOAlt {
                dcmi_HSYNC = 13,
                ltdc_VSYNC = 14,
                usart2_CK = 7,
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 4;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin5> {
            enum class GPIOAlt {
                i2s1_CL = 5,
                spi1_SCK = 5
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 5;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin6> {
            enum class GPIOAlt {
                dcmi_PIXCK = 13,
   				ltdc_G2 = 14,
                spi1_MISO = 5
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 6;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin7> {
            enum class GPIOAlt {
                i2s1_SD = 5,
                spi1_MOSI = 5
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 7;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin11> {
            enum class GPIOAlt {
            	ltdc_R4 = 14
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 11;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portA, GPIOPin::pin12> {
            enum class GPIOAlt {
            	ltdc_R5 = 14
            };
            constexpr static const uint32_t addr = GPIOA_BASE;
            constexpr static const uint32_t pn = 12;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOAEN;
        };
    #endif

    #ifdef GPIOB_BASE
        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin0> {
            enum class GPIOAlt {
                ltdc_R3 = 9
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 0;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin1> {
            enum class GPIOAlt {
                ltdc_R6 = 9
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 1;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin8> {
            enum class GPIOAlt {
                i2c1_SCL = 4,
                ltdc_B6 = 14
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 8;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin9> {
            enum class GPIOAlt {
                i2c1_SDA = 4,
                ltdc_B7 = 14,
                spi2_NSS = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 9;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin10> {
            enum class GPIOAlt {
                i2c2_SCL = 4,
                ltdc_G4 = 14,
                spi2_SCK = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 10;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin11> {
            enum class GPIOAlt {
            	ltdc_G5 = 14
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 11;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portB, GPIOPin::pin15> {
            enum class GPIOAlt {
                spi2_MOSI = 5
            };
            constexpr static const uint32_t addr = GPIOB_BASE;
            constexpr static const uint32_t pn = 15;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };
    #endif

    #ifdef GPIOC_BASE
        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin2> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 2;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin6> {
            enum class GPIOAlt {
                ltdc_HSYNC = 14,
                uart6_TX = 8
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 6;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin7> {
            enum class GPIOAlt {
                ltdc_G6 = 14,
                uart6_RX = 8
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 7;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portC, GPIOPin::pin10> {
            enum class GPIOAlt {
                ltdc_R2 = 14,
            };
            constexpr static const uint32_t addr = GPIOC_BASE;
            constexpr static const uint32_t pn = 10;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOBEN;
        };
    #endif

    #ifdef GPIOD_BASE
        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin3> {
            enum class GPIOAlt {
                dcmi_D5 = 13,
                ltdc_G7 = 14
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 3;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIODEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin6> {
            enum class GPIOAlt {
            	ltdc_B2 = 14,
                spi3_SCK = 5,
                i2s3_SD = 5
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 6;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIODEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin7> {
            enum class GPIOAlt {
                fmc_NE1 = 12,
                usart2_CK = 7,
                spdifrx_IN0 = 8
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 7;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIODEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portD, GPIOPin::pin13> {
            enum class GPIOAlt {
            };
            constexpr static const uint32_t addr = GPIOD_BASE;
            constexpr static const uint32_t pn = 13;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIODEN;
        };
    #endif

    #ifdef GPIOE_BASE
        template <>
        struct GPIOInfo<GPIOPort::portE, GPIOPin::pin4> {
            enum class GPIOAlt {
                ltdc_B0 = 14
            };
            constexpr static const uint32_t addr = GPIOE_BASE;
            constexpr static const uint32_t pn = 4;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOEEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portE, GPIOPin::pin5> {
            enum class GPIOAlt {
                dcmi_D6 = 13
            };
            constexpr static const uint32_t addr = GPIOE_BASE;
            constexpr static const uint32_t pn = 5;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOEEN;
        };

        template <>
        struct GPIOInfo<GPIOPort::portE, GPIOPin::pin6> {
            enum class GPIOAlt {
                dcmi_D7 = 13
            };
            constexpr static const uint32_t addr = GPIOE_BASE;
            constexpr static const uint32_t pn = 6;
            constexpr static const uint32_t rccen = RCC_AHB1ENR_GPIOEEN;
        };
    #endif

